2.2.013/src/DataProcessors/МК_РасчетныеЛистки/МК_РасчетныеЛистки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МК_РасчетныеЛистки</name>
</mdclass:DataProcessor>

2.2.013/src/InformationRegisters/ДанныеДляПодбораСотрудников/ДанныеДляПодбораСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8048febd-cf83-413d-8677-04e1f791040c">
  <name>ДанныеДляПодбораСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="a5e069ee-7936-43e5-ba08-369cfef6082e">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="756ae0d9-f1d5-4f90-8a78-f9d59cf66bd0">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="2348f956-2bde-41ca-a9ce-50267a8ad6a6">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="51fb4128-5516-4c0d-9e12-c279879705d6">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

2.2.013/src/DataProcessors/МК_РасчетныеЛистки/ManagerModule.bsl
&НаСервере                                       
Функция ВыгрузкаРЛ(мПараметры) Экспорт	
	//мВозврат = Новый Массив;    // Возвращать будем массив, в котором кроме успешности действий будут адреса
	//                            // двух файлов во временном хранилище: сам архив табулек(zip) и его описание(json) - для выгрузки в файлы
	//мВозврат.Добавить(3);		// Первый элемент - общий результат: 0 - ошибка авторизации, 
								// 									 1 - ошибка отправки файла табулек, 
								//                                   2 - ошибка отправки файла-описания
								//                                   3 - все отправилось успешно.
								//                                   4 - ошибка отправки зарплаты
	//мВозврат.Добавить(0);		// Второй элемент - кол-во табулек    
	мМаксКС = Константы.МК_МаксКолвоСотрВВыгрузке.Получить();;    // Максимальное кол-во сотрудников, отправляемых за один раз  
	Если мМаксКС = 0 Тогда                                        // Если 0, то значение по умолчанию - 1000
		мМаксКС = 1000;
	КонецЕсли;	    
	мДирКлиент = Неопределено;
	мВозврат = Новый Структура;
    мВозврат.Вставить("КодРезультата",3);
	мВозврат.Вставить("Колво",0);
	//мГод = Формат(мПараметры.мГод,"ЧГ=0");
	мГод = мПараметры.мГод;
	мМесяц = мПараметры.мМесяц;
	ДатаНачМес = Дата(мГод,мМесяц,1);  
	мВыгрузкаРЛ = мПараметры.ВыгружатьРЛ;  
	мВыгрузкаЗП = мПараметры.ВыгружатьДанныеОЗП;
	// Получим список сотрудников, по которым нужно сформировать и отправить
	// расчетные листки. Пока - это все сотрудники, относящиеся к выгружаемым организациям. 
	ИнтерактивныйРежим = мПараметры.ИнтерактивныйРежим;  
	мСпособВыгрузки = 1;
	Если ИнтерактивныйРежим Тогда
		// Следующие параметры передаются только в интерактивном режиме.
		УникальныйИдентификаторФормы = мПараметры.УникальныйИдентификаторФормы;    
		мДирКлиент = мПараметры.мДир;
		мСпособВыгрузки = мПараметры.мСпособВыгрузки;  
		мАдресРез1 = мПараметры.мАдрес1;         // Расчетные листки (PDF в ZIP)
		мАдресРез2 = мПараметры.мАдрес2;         // Описание расчетных листков  (JSON)
		мАдресРез3 = мПараметры.мАдрес3;         // Зарплата сотрудников (JSON либо ZIP c JSON)
		мАдресРез4 = мПараметры.мАдрес4;         // Справочники начислений/удержаний
	КонецЕсли;	
	мСеанс = Неопределено;
	мРезультат = Истина;
	мНужен = Истина;
	мРЛ = Новый Массив;     // Сюда будем складировать инфу о сформированных и отправленных листках.     
	мНУ = Новый Массив;     // Тут будут начисления/удержания.
	мНомер = 0; 
	мНомер1 = 0; 
	
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
	
	// Теперь надо получить имя временного каталога, в который будем складывать pdf файлы табулек перед архивированием.
	мВремДир = ФайловаяСистема.СоздатьВременныйКаталог();  
	мДирОРЛ = мВремДир + "RL" + ПолучитьРазделительПутиСервера();    // Общая папка для всех расчетных листков. В ней будут папки-порции.
	СоздатьКаталог(мДирОРЛ);   
	мДирРЛ = мДирОРЛ + "Dir_1" + ПолучитьРазделительПутиСервера(); 
	СоздатьКаталог(мДирРЛ);   
	
	Если мСпособВыгрузки = 1 Тогда   // На сервер.    
		мСеанс = ОО.СоздатьСеансСвязи(ИнтерактивныйРежим);
		Если мСеанс = Неопределено Тогда
			// Ошибка авторизации. Ничего не отправляем. 
			мВозврат.КодРезультата = 0;
			мРезультат = Ложь;
			ФайловаяСистема.УдалитьВременныйКаталог(мВремДир);
			Возврат мВозврат;        // НА ЭТОМ ОБРАБОТКА ПРЕКРАЩЕНА!!!
        КонецЕсли;
	Иначе                            // На диск. Это для сведений о зарплате.
		мДирЗП = мВремДир+"Salary" + ПолучитьРазделительПутиСервера();        // Если порций несколько, json-файлы будут создаваться в этом каталоге, потом архивироваться и отдаваться клиенту
		СоздатьКаталог(мДирЗП);   
	КонецЕсли;	 			
	
	// Первым делом получим нужные организации
	СписокОрганизаций = ОО.ПолучитьСписокОрганизаций();    
	// Тут же получим данные по другим фильтрам выгрузки
	ФильтрСотрудники = ОО.ПолучитьФильтрСотрудники();   // Возвращается массив: {ВидДействия,СписокСотрудников} Вид действия: "0" - не учитывать, "1" - выгружать, "2" - не выгружать.
	ФильтрДолжности = ОО.ПолучитьФильтрДолжности(); 
	ФильтрВидыЗанятости = ОО.ПолучитьФильтрВидыЗанятости(); 
	ФильтрПодразделения = ОО.ПолучитьФильтрПодразделения();  	
	
	Если ИнтерактивныйРежим Тогда
		ДлительныеОперации.СообщитьПрогресс("","Выполняется запрос списка сотрудников");
	КонецЕсли;	
    СписокСотрудников = ПолучитьСписокСотрудников(СписокОрганизаций,ФильтрВидыЗанятости,ФильтрПодразделения,ФильтрДолжности,ФильтрСотрудники,ДатаНачМес);      
	
	Если мВыгрузкаЗП Тогда          // Отработанное время (и плановое) нужно только если выполняется выгрузка начислений и удержаний.
		мВремя = ПолучитьВремяСотрудников(СписокСотрудников, мГод, мМесяц);       // Возращается таблица значений с полями "Сотрудник", "Дней", "Часов".
	КонецЕсли;
	// Считаем настройки контактной информации.
	мВидКонтИнф = ОО.ПолучитьВидыКонтИнф(); // Это массив видов контактной информации 1С: 0 - Осн.Эл.Почта, 1 - Доп.Эл.Почта, 2 - Телефон 

	// Организуем показ прогресса в работе.
	ВсегоСотр = СписокСотрудников.Количество();
	мнСотр = 0;        // Обработанные сотрудники и сформированные листки - не одно и то же.
	
	мНомерПорции = 0;
	мКолвоПорции = 0;   
	мОКолво = 0;     // Общее количество выгруженных сотрудников.
	Для Каждого мСотр из СписокСотрудников Цикл
	    мнСотр = мнСотр+1;
		Если мСотр.ВАрхиве  
			ИЛИ (мСотр.ПоДоговоруГПХ       // У договорников нет дат поступления/увольнения. Вместо них - Начало и Окончание
				И (мСотр.Начало = Дата(1,1,1)
				ИЛИ (мСотр.Окончание > Дата(1,1,1)
				И мСотр.Окончание < ДатаНачМес)))
			ИЛИ (НЕ мСотр.ПоДоговоруГПХ
				И (мСотр.ДатаПриема = Дата(1,1,1) 
				ИЛИ (мСотр.ДатаУвольнения > Дата(1,1,1) 
				И мСотр.ДатаУвольнения < ДатаНачМес)))
			ИЛИ НЕ ЗначениеЗаполнено(мСотр.Ссылка)
			ИЛИ НЕ ЗначениеЗаполнено(мСотр.ОрганизацияСотрудника) Тогда
			Продолжить;
		КонецЕсли;  
		
		мНужен = Ложь; 
		мСписКонт = мСотр.КонтактнаяИнформация;   // Расчетные листки будем отправлять только на сотрудников, имеющих "главную" почту
        Для Каждого ВыбКонт из мСписКонт Цикл 
			Если ВыбКонт.Вид = мВидКонтИнф[0] Тогда  // Это - вид главной почты.
				мНужен = Истина;
            КонецЕсли; 
		КонецЦикла;

		// Сформируем расчетный листок
		Если мНужен Тогда
			мИтогРЛ = СоздатьРЛвPDF(мСотр.ОрганизацияСотрудника, мСотр.Ссылка, ДатаНачМес, мДирРЛ, мВыгрузкаРЛ, мВыгрузкаЗП);  // Возвращается массив элемент 0  - имя PDF-файла, 1 - массив - список начислений/удержаний.   
			Если мИтогРЛ[0] <> Неопределено Или мИтогРЛ[1] <> Неопределено Тогда
				Если мВыгрузкаРЛ И ЗначениеЗаполнено(мИтогРЛ[0]) Тогда  
					Сотрудник = Новый Структура;    
					мНомер = мНомер + 1;
					Сотрудник.Вставить("xml_id", СокрЛП(мНомер));
					Сотрудник.Вставить("user_id", СокрЛП(мСотр.Ссылка.УникальныйИдентификатор()));  
					Сотрудник.Вставить("user_fio", мСотр.НаименованиеСотрудника);
    	        	Сотрудник.Вставить("file_name", мИтогРЛ[0]);  
					Сотрудник.Вставить("month", мМесяц); 
					Сотрудник.Вставить("year", мГод);      
					мРЛ.Добавить(Сотрудник); 					
				КонецЕсли;	
				Если мВыгрузкаЗП И ЗначениеЗаполнено(мИтогРЛ[1]) Тогда
					// Посчитаем итоги начислений и удержаний
					мНач = 0;
					мУдер = 0;
					Для Каждого мЗапись Из мИтогРЛ[1] Цикл
						Если мЗапись.vid = 1 Тогда
							мНач = мНач + мЗапись.summa;
						Иначе
							мУдер = мУдер + мЗапись.summa;
						КонецЕсли;	
					КонецЦикла;	        
					мДни = 0;
					мЧасы = 0;
					мСтрока = мВремя.Найти(мСотр.Ссылка,"Сотрудник");
					Если мСтрока <> Неопределено Тогда
						мДни = мСтрока.Дней;
						мЧасы = мСтрока.Часов;
					КонецЕсли;	
					мНомер1 = мНомер1 + 1;
					мНУСотр = Новый Структура;
					//мНУСотр.Вставить("xml_id", СокрЛП(мНомер));
					мНУСотр.Вставить("xml_id", мНомер1);
					мНУСотр.Вставить("user_id", СокрЛП(мСотр.Ссылка.УникальныйИдентификатор()));
					мНУСотр.Вставить("user_fio", мСотр.НаименованиеСотрудника);
					мНУСотр.Вставить("month", мМесяц); 
					мНУСотр.Вставить("year", мГод);   
					мНУСотр.Вставить("payroll_total", мНач);   
					мНУСотр.Вставить("deduction_total", мУдер); 					
					Если СписокСотрудников.Колонки.Найти("СтраховыеВзносы") <> Неопределено Тогда	
						мНУСотр.Вставить("insurance_contributions", мСотр.СтраховыеВзносы);   
					Иначе	                                                                  
						мНУСотр.Вставить("insurance_contributions", 0);   
					КонецЕсли;	
					мНУСотр.Вставить("total_days",мДни);
					мНУСотр.Вставить("total_hours",мЧасы);
					мНУСотр.Вставить("n_u",мИтогРЛ[1]);					
					мНУ.Добавить(мНУСотр);					
				КонецЕсли;	
				мКолвоПорции = мКолвоПорции + 1;     
				Если мКолвоПорции = мМаксКС Тогда     
					мНомерПорции = мНомерПорции + 1;
					Если мСпособВыгрузки = 1 Тогда        // На сайт   
						Если мВыгрузкаЗП Тогда
							мРезультат = ВыгрузитьНачисленияУдержания(мНУ, мВозврат, ОО, ИнтерактивныйРежим, мСеанс);  // Отправляем порцию зарплаты
						КонецЕсли;	
						// Кроме того, нужно заархивировать накопившиеся PDF - файлы и отправить их в МояКоманда
						Если мВыгрузкаРЛ Тогда
							ОтправитьПорциюРЛ(мДирРЛ, мВозврат, ОО, ИнтерактивныйРежим, мСеанс, мГод, мМесяц, мНомерПорции);
						КонецЕсли;	
					Иначе	                              // В файл   
						Если мВыгрузкаЗП Тогда
							мРезультат = СохранитьПорциюНаДиск(мНУ,мНомерПорции,мДирЗП);
						КонецЕсли;	
						// Если выгружаем на диск и оказалось больше одной порции, тут нужно создать новую папку для этой порции 
						Если мВыгрузкаРЛ Тогда
							мДирРЛ = мДирОРЛ+"Dir_"+(мНомерПорции+1) + ПолучитьРазделительПутиСервера(); 
							СоздатьКаталог(мДирРЛ);  
							// Следующие pdf-файлы будут попадать в новую папку. 
						КонецЕсли;														
					КонецЕсли;
					мОКолво = мОКолво + мКолвоПорции;
					мКолвоПорции = 0;
					мНУ.Очистить();			
				КонецЕсли;	   		
			КонецЕсли;	
		КонецЕсли;
		ПроцВып = Окр(мнСотр/ВсегоСотр*100,0);		
		// Cообщаем "процент" и "текст сообщения"    
		Если ИнтерактивныйРежим Тогда
			ДлительныеОперации.СообщитьПрогресс(ПроцВып,"Формируются данные о заработной плате");
		КонецЕсли;	
	КонецЦикла;	     
	
	// Если в последней порции что-то есть, надо отправить
	// Если мНомер > 0 Тогда  
	Если мКолвоПорции > 0 Тогда  		
		мОКолво = мОКолво + мКолвоПорции;
		Если мСпособВыгрузки = 1 Тогда        // На сайт 
			Если мВыгрузкаЗП Тогда	
				мРезультат = ВыгрузитьНачисленияУдержания(мНУ, мВозврат, ОО, ИнтерактивныйРежим, мСеанс);  // Отправляем последнюю порцию зарплаты
			КонецЕсли;	
			// Кроме того, нужно заархивировать накопившиеся PDF - файлы и отправить их в МояКоманда 
			Если мВыгрузкаРЛ Тогда
				ОтправитьПорциюРЛ(мДирРЛ, мВозврат, ОО, ИнтерактивныйРежим, мСеанс, мГод, мМесяц, мНомерПорции);
			КонецЕсли;	
		Иначе	                              // В файл     
			Если мВыгрузкаЗП Тогда
				ДлительныеОперации.СообщитьПрогресс("","Файл копируется в указанный каталог");   
				Если мНомерПорции = 0 Тогда          // Если ни одной порции зарплаты еще не было сохранено, то отправляем JSON файл.   
					ВыгрузитьСправочникиНУ(мСпособВыгрузки, мВозврат, мДирКлиент, ОО, ИнтерактивныйРежим, мАдресРез4, мСеанс);
					ЗаписьJSON = Новый ЗаписьJSON;
					ЗаписьJSON.УстановитьСтроку();
        			ЗаписатьJSON(ЗаписьJSON,мНУ);	
					ТекстJSON = ЗаписьJSON.Закрыть();
					мАдрес3 = ПоместитьВоВременноеХранилище(ТекстJSON,мАдресРез3);				
					мВозврат.Вставить("АдресЗарплаты",мАдрес3);      // Адрес zip-архива.
					мВозврат.Вставить("ИмяЗарплаты",ОО.ПолучитьИмяФайла("ЗарплатаСотрудников",мДирКлиент));    								
				Иначе	
					мНомерПорции = мНомерПорции + 1;
					мРезультат = СохранитьПорциюНаДиск(мНУ,мНомерПорции,мДирЗП);
				КонецЕсли;	
				// Все файлы с зарплатой надо заархивировать и положить в хранилище.
			КонецЕсли;	      
			// Тут надо заархивировать все папки с табульками и положить в хранилище.
		КонецЕсли;
	КонецЕсли;                                                
	
	мВозврат.Колво = мОКолво;   // Кол-во созданных табулек    
	
	// В последней порции может ничего не быть. Поэтому тут надо выполнить завершающие действия с 
	// расчетными листками и зарплатой при сохранении на диск. В случае отправки в МояКоманда с ними все завершено.
	Если мОКолво > 0 И мСпособВыгрузки = 2 Тогда  
		Если мВыгрузкаРЛ Тогда
			ИмяАрхива = мДирРЛ+"RL_"+Формат(ДатаНачМес, "ДФ=гггг")+"_"+Формат(ДатаНачМес, "ДФ=ММ")+".zip";
			мАрхив = Новый ЗаписьZipФайла(ИмяАрхива,"", "Расчетные листки за "+мМесяц+" месяц "+мГод+" года",МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Оптимальный, МетодШифрованияZIP.Zip20);
			Если мНомерПорции = 0 Тогда
				// Тут надо архивировать один каталог - текущий мДирРЛ		
				мФайлы = мДирРЛ+"*.pdf";
				мАрхив.Добавить(мФайлы);
				мАрхив.Записать();
			Иначе
				// Тут архивируем каталог мДирОРЛ, со всемы вложенными папками			
				мФайлы = мДирОРЛ + "*.*" ; 		// */pdf - не работает - говорит, что не найдена такая папка. А *.* - нормально отрабатывает.
				мАрхив.Добавить(мФайлы,РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);  					
				мАрхив.Записать();				
			КонецЕсли;
			ДлительныеОперации.СообщитьПрогресс("","Архив копируется в указанный каталог");
			мФайл1 = Сред(ИмяАрхива, СтрНайти(ИмяАрхива, ПолучитьРазделительПутиСервера(), НаправлениеПоиска.СКонца) + 1);     // Выделяем только имя файла
			Попытка          	    	 
				Двоичное=Новый ДвоичныеДанные(ИмяАрхива);
				мАдрес1 = ПоместитьВоВременноеХранилище(Двоичное,мАдресРез1);     
				мВозврат.Вставить("АдресZIPАрхива",мАдрес1);  // Адрес zip-архива.    			
				мВозврат.Вставить("ИмяZIPАрхива",мФайл1);     // Имя файла уже вычислено. Передаем.
			Исключение    
				мРезультат = Ложь;
				мВозврат.КодРезультата = 1;
			КонецПопытки;	
		КонецЕсли;	
        // С расчетными листками завершили. Теперь - сведения о зарплате.
		Если мВыгрузкаЗП Тогда
			Если мНомерПорции > 0 Тогда     
				ВыгрузитьСправочникиНУ(мСпособВыгрузки, мВозврат, мДирКлиент, ОО, ИнтерактивныйРежим, мАдресРез4, мСеанс);
				// Надо заархивировать все порции зарплаты и отправить на клиента
    	       	ИмяАрхива = мДирЗП + "ЗарплатаСотрудников"+"_"+ОО.ДатаВСтроку(ТекущаяДата())+".zip";
				мАрхив = Новый ЗаписьZipФайла(ИмяАрхива,"", "Зарплата сотрудников",МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Оптимальный, МетодШифрованияZIP.Zip20);
				мАрхив.Добавить(мДирЗП+"*.json");
				мАрхив.Записать();    		
				мФайлАрхив = Сред(ИмяАрхива, СтрНайти(ИмяАрхива, ПолучитьРазделительПутиСервера(), НаправлениеПоиска.СКонца) + 1);     // Выделяем только имя файла
				Попытка          	    	 
					Двоичное=Новый ДвоичныеДанные(ИмяАрхива);
					мАдрес3 = ПоместитьВоВременноеХранилище(Двоичное,мАдресРез3);     
					мВозврат.Вставить("АдресЗарплаты",мАдрес3);      // Адрес zip-архива.
					мВозврат.Вставить("ИмяЗарплаты",мФайлАрхив);    				
				Исключение    
					мРезультат = Ложь;
					мВозврат.Вставить("АдресЗарплаты",Неопределено);
					мВозврат.Вставить("ИмяЗарплаты",Неопределено);
				КонецПопытки;	
			КонецЕсли;			
		КонецЕсли;					
	КонецЕсли;	
	// После отправки zip файла нужно удалить временный каталог с pdf-ми и zip'ом. Но если даже ни одной табульки не создано,
	// каталог все равно надо удалить
	Попытка	
		ФайловаяСистема.УдалитьВременныйКаталог(мВремДир);
	Исключение  
		Если ИнтерактивныйРежим Тогда
			Сообщить(ОписаниеОшибки());
		Иначе
		КонецЕсли;	
	КонецПопытки;	
	
	Если мОКолво > 0 И мРезультат И мВыгрузкаРЛ Тогда   // Если файл табулек на отправился, или не поместился в хранилище, нет смысла отправлять описание   
		
		Выгрузка = Новый Структура;  
		Выгрузка.Вставить("pay_sheets",мРЛ); 
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();

		Если мСпособВыгрузки = 1 Тогда
			// Тут надо отправить запрос со списком отправленных листков. 
			Попытка
				ЗаписатьJSON(ЗаписьJSON, Выгрузка);	
				ТекстJSON = ЗаписьJSON.Закрыть();
			Исключение      
				Если ИнтерактивныйРежим Тогда
					Сообщить(ЗначениеВСтрокуВнутр(Выгрузка));
				КонецЕсли;	
				ВызватьИсключение(ОписаниеОшибки());
				мРезультат = Ложь;
				мВозврат.КодРезультата = 2;
			КонецПопытки;
    	    Если мРезультат Тогда
			    hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/pay-list", мСеанс);  
				hЗапрос.УстановитьТелоИзСтроки(ТекстJSON); 
				hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
				hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос); 
				мРезультат = ОО.ПроверитьОтвет(hОтвет,"Описание расчетных листков",ИнтерактивныйРежим);  
				Если НЕ мРезультат Тогда
					мВозврат.КодРезультата = 2;  // Не удалось отправить файл-описание
				КонецЕсли;					
			КонецЕсли;
		Иначе
			Если мРезультат Тогда				
				ЗаписатьJSON(ЗаписьJSON, Выгрузка);	
				ТекстJSON = ЗаписьJSON.Закрыть();
    	        мАдрес2 = ПоместитьВоВременноеХранилище(ТекстJSON,мАдресРез2);
				мВозврат.Вставить("АдресОписания",мАдрес2);
				мВозврат.Вставить("ИмяОписания",ОО.ПолучитьИмяФайла("ОписаниеРасчЛист",мДирКлиент));
			КонецЕсли;	
		КонецЕсли;   
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции   

Функция ПолучитьВремяСотрудников(мСписок, мГод, мМесяц)  
	мДатаНачала = Дата(мГод,мМесяц,1);  
	мДатаОкончания = КонецМесяца(мДатаНачала);
	ПараметрыПолученияДанных = УчетРабочегоВремениРасширенный.ПараметрыДляЗапросВТДанныеУчетаВремениИСостоянийСотрудников();
    ПараметрыПолученияДанных.ДатаНачала = мДатаНачала;
    ПараметрыПолученияДанных.ДатаОкончания = мДатаОкончания;
    
    ПараметрыПолученияДанных.МесяцДатаНачала = мДатаНачала;
    ПараметрыПолученияДанных.МесяцДатаОкончания = мДатаОкончания;
    ПараметрыПолученияДанных.ДатаАктуальности = ТекущаяДата();
        
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;   
	
	Запрос.УстановитьПараметр("Сотрудники", мСписок);
	Запрос.УстановитьПараметр("ДатаНачала", мДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", мДатаОкончания);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ		
		|	&ДатаНачала КАК ДатаНачала,
	    |	&ДатаОкончания КАК ДатаОкончания,
		|	Сотрудники.Ссылка КАК Сотрудник
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&Сотрудники)";
	
	Запрос.ВыполнитьПакет();
        
    УчетРабочегоВремениРасширенный.СоздатьВТДанныеУчетаВремениИСостоянийСотрудников(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияДанных);
    ТЗ1 = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("ВТДанныеУчетаРабочегоВремениСотрудников").ПолучитьДанные().Выгрузить();  
	Отбор = Новый Структура;
    Отбор.Вставить("ОсновноеВремя", Справочники.ВидыИспользованияРабочегоВремени.РабочееВремя);
    ТЗ2 = ТЗ1.Скопировать(Отбор);  
	ТЗ2.Свернуть("Сотрудник", "Дней,Часов");  
	Возврат тЗ2;
КонецФункции	


Функция ОтправитьПорциюРЛ(мДирРЛ, мВозврат, ОО, ИнтерактивныйРежим, мСеанс, мГод, мМесяц, мНомерПорции)
	Если ИнтерактивныйРежим Тогда
		ДлительныеОперации.СообщитьПрогресс("","Архивируются расчетные листки");
	КонецЕсли;	
	ИмяАрхива = мДирРЛ+"RL_"+мГод+"_"+мМесяц; 
	Если мНомерПорции > 0 Тогда
		ИмяАрхива = ИмяАрхива+"_"+мНомерПорции;
	КонецЕсли;	
	ИмяАрхива = ИмяАрхива+".zip";
	мАрхив = Новый ЗаписьZipФайла(ИмяАрхива,"", "Расчетные листки за "+мМесяц+" месяц "+мГод+" года",МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Оптимальный, МетодШифрованияZIP.Zip20); 
	мФайлы = мДирРЛ + "*.pdf";
	мАрхив.Добавить(мФайлы);
	мАрхив.Записать();	
	мРезультат = ОО.ВыгрузитьФайлНаСайт(ИмяАрхива, мСеанс, "pdf", ИнтерактивныйРежим, "/api/1c-exchange/pay-list/upload", "Расчетные листки");
	Если НЕ мРезультат Тогда
		мВозврат.КодРезультата = 1      // Ошибка отправки файла табулек
	КонецЕсли;	                                                                 
	Возврат мРезультат;
КонецФункции	

Функция ВыгрузитьНачисленияУдержания(мНУ, мВозврат, ОО, ИнтерактивныйРежим, мСеанс)	 
	// Тут только выгрузка в МояКоманда
	Если ИнтерактивныйРежим Тогда
		ДлительныеОперации.СообщитьПрогресс("","Сведения отправляются на сайт МояКоманда");
	КонецЕсли;
	// Перед выгрузкой зарплаты нужно выгрузить справочники начислений и удержаний.
	мРез = ВыгрузитьСправочникиНУ(1, мВозврат, ,ОО, ИнтерактивныйРежим,, мСеанс);   
	                              
	Если мРез Тогда
		Выгрузка = Новый Структура;  
		Выгрузка.Вставить("salary",мНУ); 
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();

		// Тут надо отправить запрос со сведениями о зарплате. 
		Попытка
			ЗаписатьJSON(ЗаписьJSON, Выгрузка);	
			ТекстJSON = ЗаписьJSON.Закрыть();
		Исключение      
			Если ИнтерактивныйРежим Тогда
				Сообщить(ЗначениеВСтрокуВнутр(Выгрузка));
			КонецЕсли;	
			ВызватьИсключение(ОписаниеОшибки());
			мРез = Ложь;
			мВозврат.КодРезультата = 4;
		КонецПопытки;
        Если мРез Тогда    // Пока нет енд-пойнтов для выгрузки
		    hЗапрос = ОО.СоздатьHTTPЗапрос("api/1c-exchange/user-accruals", мСеанс);  
			hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);   
			// Изменение в логике создания запросов. Бывают ситуации, когда запрос не успевает обработаться и обрывается по тайм-ауту. Поэтому 
			// переходим на серию запросов, которые надо запускать через некоторую паузу, до получения окончательного результата.				
			мРез = ОО.ВызватьhМетод("POST", мСеанс, hЗапрос,"/api/1c-exchange/user-accruals", "ЗарплатаСотрудников", ИнтерактивныйРежим);
			Если НЕ мРез Тогда
				мВозврат.КодРезультата = 4;  // Не удалось отправить зарплату
			КонецЕсли;					
		КонецЕсли;
	КонецЕсли;   	
	Возврат мРез;
КонецФункции	 

Функция СохранитьПорциюНаДиск(Выгрузка,мНомерПорции,мДирЗП);    
	мРезультат = Истина;
	ИмяФайла = мДирЗП+"ЗарплатаСотрудников"+мНомерПорции+".json";
	ЗаписьJSON = Новый ЗаписьJSON;  
	Попытка
		ЗаписьJSON.ОткрытьФайл(ИмяФайла);
		ЗаписатьJSON(ЗаписьJSON,Выгрузка); 
		ЗаписьJSON.Закрыть();
	Исключение
		мРезультат = Ложь;
	КонецПопытки;		
	Возврат мРезультат;
КонецФункции


Функция ВыгрузитьСправочникиНУ(мСпособВыгрузки, мВозврат, мДир1, ОО, ИнтерактивныйРежим, мАдресРез4, мСеанс)  
	мНач = Новый Массив;
	мУдер = Новый Массив;       
	мРез = Истина;
	// Сначала - наш справочник, отражающий особые начисления и удержания
	мОсобыеНУ = Справочники.МК_ОсобыеНачисленияУдержания.МК_ВсеОсобыеНУ(); // Возвращает все особые начисления и удержания: УИД(строка), вид(1/2), имя(строка) 
	Для Каждого мОсобый ИЗ мОсобыеНУ Цикл
		Если мОсобый.Вид = 1 Тогда    // Начисление
			мВидНач = Новый Структура;
			мВидНач.Вставить("id", мОсобый.УИД);
			мВидНач.Вставить("name", мОсобый.Имя);
			мНач.Добавить(мВидНач);
		Иначе                         
			мВидУдер = Новый Структура;
			мВидУдер.Вставить("id", мОсобый.УИД);
			мВидУдер.Вставить("name", мОсобый.Имя);
			мУдер.Добавить(мВидУдер);
		КонецЕсли;	
	КонецЦикла;	
	// Теперь - справочник начислений.
	мЗапрос = Новый Запрос;
	мЗапрос.Текст =    
		"ВЫБРАТЬ
	    |	ПланНачислений.Ссылка КАК Ссылка,
		|	ПланНачислений.Наименование КАК Наименование
		|ИЗ
		|	ПланВидовРасчета.Начисления Как ПланНачислений";

 	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		мВидНач = Новый Структура;
		мВидНач.Вставить("id", СокрЛП(Выборка.Ссылка.УникальныйИдентификатор()));
		мВидНач.Вставить("name", Выборка.Наименование);
		мНач.Добавить(мВидНач);
	КонецЦикла;	
	
	// Справочник удержаний.
	мЗапрос = Новый Запрос;
	мЗапрос.Текст =    
		"ВЫБРАТЬ
	    |	ПланУдержаний.Ссылка КАК Ссылка,
		|	ПланУдержаний.Наименование КАК Наименование
		|ИЗ
		|	ПланВидовРасчета.Удержания Как ПланУдержаний";

 	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		мВидУдер = Новый Структура;
		мВидУдер.Вставить("id", СокрЛП(Выборка.Ссылка.УникальныйИдентификатор()));
		мВидУдер.Вставить("name", Выборка.Наименование);
		мУдер.Добавить(мВидУдер);
	КонецЦикла;	
	
	мВыгрузка = Новый Структура;
	мВыгрузка.Вставить("payroll",мНач);
	мВыгрузка.Вставить("deduction",мУдер);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	Если мСпособВыгрузки = 1 Тогда
		Попытка
			ЗаписатьJSON(ЗаписьJSON, мВыгрузка);	
			ТекстJSON = ЗаписьJSON.Закрыть();
		Исключение  
			мРез = Ложь;
			Сообщить(ЗначениеВСтрокуВнутр(мВыгрузка));
			ВызватьИсключение(ОписаниеОшибки());
		КонецПопытки; 

		мРез = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен).
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/types-accruals", мСеанс);     
		hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);
		мОтвет = ОО.ПроверитьОтвет(hОтвет,"Справочники начислений и удержаний",ИнтерактивныйРежим);   // Пока этот мОтвет не анализируется.		
	Иначе   // Выгружаем на диск.  
		// Справочники выгружаются перед каждой порцией. И записываются в один и тот же адрес. В итоге на клиента уйдет последний.
		ЗаписатьJSON(ЗаписьJSON, мВыгрузка);	
		ТекстJSON = ЗаписьJSON.Закрыть();
        мАдрес4 = ПоместитьВоВременноеХранилище(ТекстJSON,мАдресРез4); 
		мВозврат.Вставить("СправочникиНУ",мАдрес4);
		мВозврат.Вставить("ИмяСправНУ",ОО.ПолучитьИмяФайла("СправочникиНУ",мДир1));		
    КонецЕсли;     	
	Возврат мРез;  
КонецФункции	


Функция ПолучитьСписокСотрудников(СписокОрганизаций,ФильтрВидыЗанятости,ФильтрПодразделения,ФильтрДолжности,ФильтрСотрудники, ДатаНачМес) 
	мДатаН = НачалоМесяца(ДатаНачМес);
	мДатаК = КонецМесяца(ДатаНачМес);
	
	УстановитьПривилегированныйРежим(Истина);          
	мБезСВ = Истина;
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Организации", СписокОрганизаций);
	мЗапрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата());
	мЗапрос.УстановитьПараметр("НачПериод", мДатаН);
	мЗапрос.УстановитьПараметр("КонПериод", мДатаК);   
	// 26.11.2025 Выяснилось, что в казахской версии ЗУП нет некоторых полей в регистре накопления
	// СтраховыеВзносыПоФизическимЛицам. Реально их нет у них совсем. Поэтому сделан упрощенный текст запроса
	// для иностраных пользователей.
	Если Метаданные.РегистрыНакопления.СтраховыеВзносыПоФизическимЛицам.Ресурсы.Найти("ОПСпоМеждународнымДоговорам") <> Неопределено   Тогда
		мБезСВ = Ложь;
		мЗапрос.Текст =    
		"ВЫБРАТЬ
		|	ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ДанныеДляПодбора.Начало) КАК Начало
		|ПОМЕСТИТЬ СрезДанных
		|ИЗ
		|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|ГДЕ
		|	ДанныеДляПодбора.Организация В(&Организации)
		|	И ДанныеДляПодбора.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|	И ДанныеДляПодбора.Начало <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ДанныеДляПодбора.Начало <= КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И (ДанныеДляПодбора.Окончание = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ДанныеДляПодбора.Окончание >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|   &УсловияФильтров
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|
		|// Страховые взносы 
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ      
		|	СтраховыеВзносыПоФизическимЛицамОбороты.Сотрудник КАК Сотрудник,
		|   СУММА(СтраховыеВзносыПоФизическимЛицамОбороты.ПФРДоПредельнойВеличиныОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ПФРСПревышенияОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ПФРПоСуммарномуТарифуОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ФССОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ФССНесчастныеСлучаиОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ФФОМСОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ПФРНаДоплатуЛетчикамОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ПФРНаДоплатуШахтерамОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ПФРСтраховаяОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ПФРНакопительнаяОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ТФОМСОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценкиОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценкаОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценкиОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценкаОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ОПСпоМеждународнымДоговорамОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ОПСпоМеждународнымДоговорамСПревышенияОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ОМСпоМеждународнымДоговорамОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ОМСпоМеждународнымДоговорамСПревышенияОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ОССпоМеждународнымДоговорамОборот +
		|	СтраховыеВзносыПоФизическимЛицамОбороты.ОССпоМеждународнымДоговорамСПревышенияОборот) КАК СтраховыеВзносы
		//|	СтраховыеВзносыПоФизическимЛицамОбороты.ФизическоеЛицо КАК ФизическоеЛицо,		
		//|	СтраховыеВзносыПоФизическимЛицамОбороты.Организация КАК Организация  
		|ПОМЕСТИТЬ ТабСВ
		|ИЗ
		|	РегистрНакопления.СтраховыеВзносыПоФизическимЛицам.Обороты(
		|						&НачПериод,
		|                       &КонПериод,
		|                       Месяц)
		|						КАК СтраховыеВзносыПоФизическимЛицамОбороты
        |СГРУППИРОВАТЬ ПО
		|	СтраховыеВзносыПоФизическимЛицамОбороты.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтраховыеВзносыПоФизическимЛицамОбороты.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникСотрудники.Ссылка КАК Ссылка,
		|	СправочникСотрудники.Код КАК Код,
		|	ДанныеДляПодбора.Наименование КАК НаименованиеСотрудника,
		|	СправочникСотрудники.ВАрхиве КАК ВАрхиве,
		|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриема,
		|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУвольнения,
		|	ВЫБОР
		|		КОГДА ДанныеДляПодбора.Филиал = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА ДанныеДляПодбора.Филиал
		|		ИНАЧЕ ДанныеДляПодбора.Организация
		|	КОНЕЦ КАК ОрганизацияСотрудника,
		|	СправочникСотрудники.ПометкаУдаления КАК ПометкаУдаления,
		|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
		|	ДанныеДляПодбора.Начало КАК Начало,
		|	ДанныеДляПодбора.Окончание КАК Окончание,  
		|	ДанныеДляПодбора.ПоДоговоруГПХ КАК ПоДоговоруГПХ,		
		|	ФизическиеЛица.КонтактнаяИнформация.(
		|		Тип КАК Тип,
		|		Вид КАК Вид,
		|		Представление КАК Представление,
		|		ЗначенияПолей КАК ЗначенияПолей
		|	) КАК КонтактнаяИнформация,   
		|   ЕстьNULL(ТабСВ.СтраховыеВзносы,0) КАК СтраховыеВзносы
		|ИЗ
		|	СрезДанных КАК СрезДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
		|		ПО (ДанныеДляПодбора.Сотрудник = СправочникСотрудники.Ссылка)
		|			И (ДанныеДляПодбора.Наименование = СправочникСотрудники.Наименование)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|		ПО (ДанныеДляПодбора.Сотрудник = ТекущиеКадровыеДанныеСотрудников.Сотрудник)
		|			И (ДанныеДляПодбора.ФизическоеЛицо = ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
		|		ПО (ДанныеДляПодбора.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО (ДанныеДляПодбора.ФизическоеЛицо = ФизическиеЛица.Ссылка)
		|       ЛЕВОЕ СОЕДИНЕНИЕ ТабСВ КАК ТабСВ
		|       ПО (ДанныеДляПодбора.Сотрудник = ТабСВ.Сотрудник)";
	Иначе
		мЗапрос.Текст =    
		"ВЫБРАТЬ
		|	ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ДанныеДляПодбора.Начало) КАК Начало
		|ПОМЕСТИТЬ СрезДанных
		|ИЗ
		|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|ГДЕ
		|	ДанныеДляПодбора.Организация В(&Организации)
		|	И ДанныеДляПодбора.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|	И ДанныеДляПодбора.Начало <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ДанныеДляПодбора.Начало <= КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И (ДанныеДляПодбора.Окончание = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ДанныеДляПодбора.Окончание >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|   &УсловияФильтров
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникСотрудники.Ссылка КАК Ссылка,
		|	СправочникСотрудники.Код КАК Код,
		|	ДанныеДляПодбора.Наименование КАК НаименованиеСотрудника,
		|	СправочникСотрудники.ВАрхиве КАК ВАрхиве,
		|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриема,
		|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУвольнения,
		|	ВЫБОР
		|		КОГДА ДанныеДляПодбора.Филиал = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА ДанныеДляПодбора.Филиал
		|		ИНАЧЕ ДанныеДляПодбора.Организация
		|	КОНЕЦ КАК ОрганизацияСотрудника,
		|	СправочникСотрудники.ПометкаУдаления КАК ПометкаУдаления,
		|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
		|	ДанныеДляПодбора.Начало КАК Начало,
		|	ДанныеДляПодбора.Окончание КАК Окончание,  
		|	ДанныеДляПодбора.ПоДоговоруГПХ КАК ПоДоговоруГПХ,		
		|	ФизическиеЛица.КонтактнаяИнформация.(
		|		Тип КАК Тип,
		|		Вид КАК Вид,
		|		Представление КАК Представление,
		|		ЗначенияПолей КАК ЗначенияПолей
		|	) КАК КонтактнаяИнформация		
		|ИЗ
		|	СрезДанных КАК СрезДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
		|		ПО (ДанныеДляПодбора.Сотрудник = СправочникСотрудники.Ссылка)
		|			И (ДанныеДляПодбора.Наименование = СправочникСотрудники.Наименование)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|		ПО (ДанныеДляПодбора.Сотрудник = ТекущиеКадровыеДанныеСотрудников.Сотрудник)
		|			И (ДанныеДляПодбора.ФизическоеЛицо = ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
		|		ПО (ДанныеДляПодбора.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО (ДанныеДляПодбора.ФизическоеЛицо = ФизическиеЛица.Ссылка)";
	КонецЕсли;	

	
	    // Тут надо добавить условия по сотрудникам, видам занятости, подразделениям и должностям, если они есть.   
	 мТекст = "";
	 Если ФильтрСотрудники[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("Сотрудники",ФильтрСотрудники[1]);	
		 Если ФильтрСотрудники[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = "   И ДанныеДляПодбора.Сотрудник В (&Сотрудники)";
	     Иначе
		     мТекст = "   И НЕ (ДанныеДляПодбора.Сотрудник В (&Сотрудники))";
		 КонецЕсли;	                                                       		   
	 КонецЕсли;	       
	  Если ФильтрДолжности[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("Должности",ФильтрДолжности[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если ФильтрДолжности[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = мТекст + "    И ДанныеДляПодбора.Должность В (&Должности)";
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.Должность В (&Должности))";
		 КонецЕсли;			   
	 КонецЕсли;                                         
	 Если ФильтрВидыЗанятости[2] = "2" Тогда   // Это про ГПХ. Тут "выгружать ГПХ" не означает, что всех остальных выгружать не надо
		 Если НЕ ПустаяСтрока(мТекст) Тогда    // Поэтому интересует только факт невыгрузки 
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 мТекст = мТекст + "    И НЕ ДанныеДляПодбора.ПоДоговоруГПХ"
	 КонецЕсли;	 
	 Если ФильтрВидыЗанятости[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("ВидыЗанятости",ФильтрВидыЗанятости[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если ФильтрВидыЗанятости[0] = "1" Тогда  // Учитываем, выгружаем.
			Если ФильтрВидыЗанятости[2] <> "2" Тогда
			 	мТекст = мТекст + "    И (ДанныеДляПодбора.ВидЗанятости В (&ВидыЗанятости) ИЛИ ДанныеДляПодбора.ПоДоговоруГПХ)";
			Иначе	
				мТекст = мТекст + "    И ДанныеДляПодбора.ВидЗанятости В (&ВидыЗанятости)";
			КонецЕсли;	
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.ВидЗанятости В (&ВидыЗанятости))";
		 КонецЕсли;			   
	 КонецЕсли;   
	  Если ФильтрПодразделения[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("Подразделения",ФильтрПодразделения[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если ФильтрПодразделения[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = мТекст + "    И ДанныеДляПодбора.Подразделение В Иерархии(&Подразделения)";
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.Подразделение В Иерархии(&Подразделения))";
		 КонецЕсли;			   
	 КонецЕсли;     

	 мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "&УсловияФильтров",мТекст); 
	
 	РезультатЗапроса = мЗапрос.ВыполнитьПакет();     
	Если мБезСВ Тогда                         
		Выборка = РезультатЗапроса[1].Выгрузить();
	Иначе	
		Выборка = РезультатЗапроса[2].Выгрузить();
	КонецЕсли;	
	Возврат Выборка;
КонецФункции


Функция СоздатьРЛвPDF(мОрг, Сотрудник, ДатаНачМес, мДир, мВыгрузкаРЛ, мВыгрузкаЗП)  
	мВозврат = Новый Массив(2);
	
	МожемСоздать = Истина;
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;

	РасчетныйЛисток = Неопределено;
		
	Попытка
		мДанныеДляРЛ = ЗарплатаКадрыОтчеты.ДанныеРасчетныхЛистков(Сотрудник.ФизическоеЛицо, мОрг, ДатаНачМес, ДатаНачМес);   // Эта функция кроме готового расчетного листка возвращает еще и
		                                                                                                                     // таблицу значений с данными для расчетного листка.
		ТабДок.Вывести(мДанныеДляРЛ.ДокументРезультат); 
		Если ТабДок.Области.Количество()= 0 Тогда
			МожемСоздать = Ложь;
		КонецЕсли;	
	Исключение
		МожемСоздать = Ложь;
	КонецПопытки;	
						              
		
	Если МожемСоздать Тогда 
		// Имена файлов договорились делать неслучайные. Имя будет состоять из id сотрудника + год и месяц листка.
		Если мВыгрузкаРЛ Тогда
			ИмяPDF = СокрЛП(Сотрудник.УникальныйИдентификатор())+"_"+Формат(ДатаНачМес, "ДФ=гггг")+"_"+Формат(ДатаНачМес, "ДФ=ММ")+".pdf";   
			ТабДок.Записать(мДир+ИмяPDF, ТипФайлаТабличногоДокумента.PDF);  
			// мВозврат = Новый Массив;
			мВозврат[0] = ИмяPDF;
		КонецЕсли;
		// Теперь список начислений/удержаний по сотруднику.
		Если мВыгрузкаЗП Тогда
			мТабРЛ = мДанныеДляРЛ.ДанныеРасчетныхЛистков.ДанныеРасчетныхЛистков;    			 
			мДанныеРЛ = Новый Массив;    
			// Тут будем заполнять массив начислений/удержаний по сотруднику и отправлять в вызывающую процедуру.
			// Там уже будут добавляться сведения по сотруднику и подсчитываться итоги.
			Для Каждого мСтрокаРЛ Из мТабРЛ Цикл
				Если мСтрокаРЛ.Группа = Перечисления.ГруппыНачисленияУдержанияВыплаты.Начислено Или мСтрокаРЛ.Группа = Перечисления.ГруппыНачисленияУдержанияВыплаты.Удержано Тогда    
					мСтр = Новый Структура;
					мСтр.Вставить("summa",мСтрокаРЛ.Сумма);  
					// Год и месяц определим по полю "ПериодДействия". Там - дата начала месяца.
					мСтр.Вставить("year",Год(мСтрокаРЛ.ПериодДействия));
					мСтр.Вставить("month",Месяц(мСтрокаРЛ.ПериодДействия));				
					Если мСтрокаРЛ.Группа = Перечисления.ГруппыНачисленияУдержанияВыплаты.Начислено Тогда  
						мСтр.Вставить("vid", 1);	
						мСтр.Вставить("time",мСтрокаРЛ.ОплаченныеДниЧасы);
						Если ТипЗнч(мСтрокаРЛ.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.Начисления") Тогда
							мСтр.Вставить("tip",СокрЛП(мСтрокаРЛ.ВидРасчета.Ссылка.УникальныйИдентификатор()));
						ИначеЕсли ТипЗнч(мСтрокаРЛ.ВидРасчета) = Тип("ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний") Тогда
							мУИД = Справочники.МК_ОсобыеНачисленияУдержания.МК_ДобавитьВернутьОсобое(мСтрокаРЛ.ВидРасчета, 1);
							Если мУИД <> Неопределено Тогда
								мСтр.Вставить("tip",СокрЛП(мУИД));
							Иначе	 // Тут надо бы сообщить о беде
							КонецЕсли;	
						Иначе
							Сообщить("Неизвестный тип");
						КонецЕсли;	
					Иначе  // Тут могут быть только удержания 
						мСтр.Вставить("vid", 2);	
						Если ТипЗнч(мСтрокаРЛ.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.Удержания") Тогда
							мСтр.Вставить("tip",СокрЛП(мСтрокаРЛ.ВидРасчета.Ссылка.УникальныйИдентификатор()));
						ИначеЕсли ТипЗнч(мСтрокаРЛ.ВидРасчета) = Тип("ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний") Тогда
							мУИД = Справочники.МК_ОсобыеНачисленияУдержания.МК_ДобавитьВернутьОсобое(мСтрокаРЛ.ВидРасчета, 2);         
							Если мУИД <> Неопределено Тогда
								мСтр.Вставить("tip",СокрЛП(мУИД));
							Иначе	 // Тут надо бы сообщить о беде
							КонецЕсли;	
						Иначе
							Сообщить("Неизвестный тип");	
						КонецЕсли;  
					КонецЕсли;	
					мДанныеРЛ.Добавить(мСтр);   			
				КонецЕсли;				
			КонецЦикла;	    
			мВозврат[1] = мДанныеРЛ;
		КонецЕсли;	
	КонецЕсли;
		
	Возврат мВозврат;
КонецФункции
